---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Density
source: html/48c06939-e1fc-3160-3302-d1830041098a.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Density Property

The density of the duct.Units: (kg/ft³).

## Syntax (C#)
```csharp
public double Density { get; }
```